DataProcessors/ПроверкаВремениРазмещенияПТУиПТОХ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ПроверкаВремениРазмещенияПТУиПТОХ</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ЗначенияСвойствОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияСвойствОбъектов</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.СвойстваОбъектов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Свойство</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СвойстваОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СтатусыПриемки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыПриемки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВПути</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаПроверкеВЧЗ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаПроверкиЧЗ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеНайденВЭДО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступилНаСклад</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбратитеВнимание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ПоступлениеТоваровНаОтветственноеХранение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПоступлениеТоваровНаОтветственноеХранение</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ТоварыОтветственногоХраненияПереданные</xr:Item>
				<xr:Item>AccumulationRegister.ЗаказыПоставщикам</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыОтветственногоХранения</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыТОХпоДаннымПоставщиков</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыОрганизаций</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыНаСкладах</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПроцесса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПроцессов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВозвратПоставщикуБезРазбораВГП</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрузополучательТОХ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВходящегоДокумента</Name>
					<Comment>(Общ) </Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПриходаТовараНаСклад</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорГрузополучателяТОХ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Comment>(Общ) </Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументВыкупаСОтветственногоХранения</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВыкупСОтветственногоХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаказНаперемещениеВОП</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИДДокументаВСмежнойБазе</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>(Общ) </Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КратностьВзаиморасчетов</Name>
					<Comment>(Общ) </Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсВзаиморасчетов</Name>
					<Comment>(Общ) </Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВходящегоДокумента</Name>
					<Comment>(Общ) </Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСкладскогоДокумента</Name>
					<Comment>(Общ) </Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>(Общ) </Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПТОХ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Comment>(Общ) Сумма в валюте документа, налоги включены согласно флагам</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТранзитнаяПоставкаЧерезСкладWMS</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Филиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШтампВерсии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
					<Comment>(Общ) </Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Comment>(Общ) </Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмеренияМест</Name>
							<Comment>(Общ) </Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаказПоставщику</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСвязи</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>(Общ) </Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоМест</Name>
							<Comment>(Общ) </Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Comment>(Общ) </Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>(Общ) </Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияНоменклатуры</Name>
							<Comment>(Общ) </Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Comment>(Общ) </Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УИД</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Comment>(Общ) </Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Comment>(Общ) </Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/ПроверкаВремениРазмещенияПТУиПТОХ/Ext/ObjectModule.bsl
Процедура РегламентноеВыполнение() Экспорт 
	
	Если Константы.МаксимальноеЧислоДнейДляРазбораТовара.Получить() = 0 Тогда
		
		ЗаписьЖурналаРегистрации("Проверка времени размещения документов ПТУ И ПТОХ", УровеньЖурналаРегистрации.Ошибка, , ,
		"Ошибка выполнения - не задана константа 'Максимальное число дней для разбора товара' ");
		
	//+Гавриленков В. 28.02.2025 #UT10-5115	
		//Возврат;  
	Иначе
		ПроверитьВремяРазмещенияПТУиПТОХ();
	//-Гавриленков В. 28.02.2025 #UT10-5115
	КонецЕсли; 
	
	//+Гавриленков В. 28.02.2025 #UT10-5115
	//ПроверитьВремяРазмещенияПТУиПТОХ(); 
	ОбновитьСтатусПоступленияЗавершено();
	//-Гавриленков В. 28.02.2025 #UT10-5115
	
КонецПроцедуры

Процедура ПроверитьВремяРазмещенияПТУиПТОХ() Экспорт
	
	ЗапросДокументов = Новый Запрос;
	ЗапросДокументов.Текст =
	"ВЫБРАТЬ
	|	Константы.МаксимальноеЧислоДнейДляРазбораТовара КАК Значение
	|ПОМЕСТИТЬ ВТ_Константа
	|ИЗ
	|	Константы КАК Константы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗначенияСвойствОбъектов.Объект КАК Документ
	|ПОМЕСТИТЬ ВТ_Поступления
	|ИЗ
	|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов,
	|	ВТ_Константа КАК ВТ_Константа
	|ГДЕ
	|	ЗначенияСвойствОбъектов.Свойство = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СвойстваОбъектов.СтатусПриемки)
	|	И ЗначенияСвойствОбъектов.Значение = ЗНАЧЕНИЕ(Перечисление.СтатусыПриемки.Обработка)
	|	И ЗначенияСвойствОбъектов.Объект.Дата < ДОБАВИТЬКДАТЕ(&Дата, ДЕНЬ, -1 * ВТ_Константа.Значение)
	|	И (ЗначенияСвойствОбъектов.Объект ССЫЛКА Документ.ПоступлениеТоваровУслуг
	|			ИЛИ ЗначенияСвойствОбъектов.Объект ССЫЛКА Документ.ПоступлениеТоваровНаОтветственноеХранение)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РазмещениеПоЯчейкам.ДокументОснование КАК Документ,
	|	МИНИМУМ(РазмещениеПоЯчейкам.Дата) КАК Дата
	|ПОМЕСТИТЬ ВТ_ПоступленияСДатамиРазмещений
	|ИЗ
	|	Документ.РазмещениеПоЯчейкам КАК РазмещениеПоЯчейкам
	|ГДЕ
	|	РазмещениеПоЯчейкам.Проведен
	|	И РазмещениеПоЯчейкам.ДокументОснование В
	|			(ВЫБРАТЬ
	|				ВТ_Поступления.Документ
	|			ИЗ
	|				ВТ_Поступления)
	|
	|СГРУППИРОВАТЬ ПО
	|	РазмещениеПоЯчейкам.ДокументОснование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПоступленияСДатамиРазмещений.Документ
	|ИЗ
	|	ВТ_ПоступленияСДатамиРазмещений КАК ВТ_ПоступленияСДатамиРазмещений,
	|	ВТ_Константа КАК ВТ_Константа
	|ГДЕ
	|	ВТ_ПоступленияСДатамиРазмещений.Дата < ДОБАВИТЬКДАТЕ(&Дата, ДЕНЬ, -1 * ВТ_Константа.Значение)";
	
	ЗапросДокументов.УстановитьПараметр("Дата",НачалоДня(ТекущаяДата()));
	
	РезультатЗапросаДокументов = ЗапросДокументов.Выполнить();
	
	Если НЕ РезультатЗапросаДокументов.Пустой() Тогда
		
		ВыборкаДокументов = РезультатЗапросаДокументов.Выбрать();
		
		Пока ВыборкаДокументов.Следующий() Цикл
			
			Попытка
				МСКWEB.УстановитьЗначениеДопСвойства(ВыборкаДокументов.Документ.Ссылка,ПланыВидовХарактеристик.СвойстваОбъектов.СтатусПриемки,Перечисления.СтатусыПриемки.ОбратитеВнимание);
			Исключение   			
			КонецПопытки;				
				
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьСтатусПоступленияЗавершено() Экспорт 
//+Гавриленков В. 28.02.2025 #UT10-5115
	
	ЗапросДокументов = Новый Запрос;
	ЗапросДокументов.Текст =
	"ВЫБРАТЬ
	|	ЗначенияСвойствОбъектов.Объект КАК Документ
	|ПОМЕСТИТЬ ВТ_Поступления
	|ИЗ
	|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|ГДЕ
	|	ЗначенияСвойствОбъектов.Свойство = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СвойстваОбъектов.СтатусПриемки)
	|	И ЗначенияСвойствОбъектов.Значение = ЗНАЧЕНИЕ(Перечисление.СтатусыПриемки.ОбратитеВнимание)
	|	И (ЗначенияСвойствОбъектов.Объект ССЫЛКА Документ.ПоступлениеТоваровУслуг
	|			ИЛИ ЗначенияСвойствОбъектов.Объект ССЫЛКА Документ.ПоступлениеТоваровНаОтветственноеХранение)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПоступлениеТоваровУслугТовары.Ссылка КАК Документ,
	|	ПоступлениеТоваровУслугТовары.Номенклатура,
	|	СУММА(ПоступлениеТоваровУслугТовары.Количество) КАК Количество
	|ПОМЕСТИТЬ ВТ_ТоварыПоступления
	|ИЗ
	|	ВТ_Поступления КАК ВТ_Поступления
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
	|		ПО ВТ_Поступления.Документ = ПоступлениеТоваровУслугТовары.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоступлениеТоваровУслугТовары.Номенклатура,
	|	ПоступлениеТоваровУслугТовары.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РазмещениеПоЯчейкамТовары.Ссылка.ДокументОснование КАК Документ,
	|	РазмещениеПоЯчейкамТовары.Номенклатура,
	|	СУММА(РазмещениеПоЯчейкамТовары.Количество) КАК Количество
	|ПОМЕСТИТЬ ВТ_ТоварыРазмещения
	|ИЗ
	|	Документ.РазмещениеПоЯчейкам.Товары КАК РазмещениеПоЯчейкамТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Поступления КАК ВТ_Поступления
	|		ПО РазмещениеПоЯчейкамТовары.Ссылка.ДокументОснование = ВТ_Поступления.Документ
	|ГДЕ
	|	РазмещениеПоЯчейкамТовары.Ссылка.Проведен
	|
	|СГРУППИРОВАТЬ ПО
	|	РазмещениеПоЯчейкамТовары.Номенклатура,
	|	РазмещениеПоЯчейкамТовары.Ссылка.ДокументОснование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Поступление.Документ,
	|	СУММА(Поступление.Количество - ЕСТЬNULL(Размещено.Количество, 0)) КАК Количество
	|ИЗ
	|	ВТ_ТоварыПоступления КАК Поступление
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТоварыРазмещения КАК Размещено
	|		ПО Поступление.Номенклатура = Размещено.Номенклатура
	|			И Поступление.Документ = Размещено.Документ
	|
	|СГРУППИРОВАТЬ ПО
	|	Поступление.Документ
	|
	|ИМЕЮЩИЕ
	|	СУММА(Поступление.Количество - ЕСТЬNULL(Размещено.Количество, 0)) = 0";
	
	РезультатЗапросаДокументов = ЗапросДокументов.Выполнить();
	
	Если НЕ РезультатЗапросаДокументов.Пустой() Тогда
		
		ВыборкаДокументов = РезультатЗапросаДокументов.Выбрать();
		
		Пока ВыборкаДокументов.Следующий() Цикл
			
			Попытка
				МСКWEB.УстановитьЗначениеДопСвойства(ВыборкаДокументов.Документ.Ссылка, ПланыВидовХарактеристик.СвойстваОбъектов.СтатусПриемки, Перечисления.СтатусыПриемки.Завершено);
			Исключение   			
			КонецПопытки;				
				
		КонецЦикла;
		
	КонецЕсли;	
	
//-Гавриленков В. 28.02.2025 #UT10-5115	
КонецПроцедуры
